{
  "LuaSnip": { "branch": "master", "commit": "REDACTED" },
  "ale": { "branch": "master", "commit": "REDACTED" },
  "auto-save.nvim": { "branch": "main", "commit": "REDACTED" },
  "cmp-buffer": { "branch": "main", "commit": "REDACTED" },
  "cmp-cmdline": { "branch": "main", "commit": "REDACTED" },
  "cmp-nvim-lsp": { "branch": "main", "commit": "REDACTED" },
  "cmp-nvim-lua": { "branch": "main", "commit": "REDACTED" },
  "cmp-path": { "branch": "main", "commit": "REDACTED" },
  "cmp_luasnip": { "branch": "master", "commit": "REDACTED" },
  "copilot.vim": { "branch": "release", "commit": "REDACTED" },
  "diffview.nvim": { "branch": "main", "commit": "REDACTED" },
  "fidget.nvim": { "branch": "main", "commit": "REDACTED" },
  "fzf": { "branch": "master", "commit": "REDACTED" },
  "fzf.vim": { "branch": "master", "commit": "REDACTED" },
  "markdown-preview.nvim": { "branch": "master", "commit": "REDACTED" },
  "nerdtree": { "branch": "master", "commit": "REDACTED" },
  "nerdtree-git-plugin": { "branch": "master", "commit": "REDACTED" },
  "nvim-autopairs": { "branch": "master", "commit": "REDACTED" },
  "nvim-cmp": { "branch": "main", "commit": "REDACTED" },
  "nvim-lsp-installer": { "branch": "main", "commit": "REDACTED" },
  "nvim-lspconfig": { "branch": "master", "commit": "REDACTED" },
  "nvim-treesitter": { "branch": "master", "commit": "REDACTED" },
  "nvim-treesitter-refactor": { "branch": "master", "commit": "REDACTED" },
  "nvim-treesitter-textobjects": { "branch": "master", "commit": "REDACTED" },
  "nvim-web-devicons": { "branch": "master", "commit": "REDACTED" },
  "plenary.nvim": { "branch": "master", "commit": "REDACTED" },
  "vim": { "branch": "master", "commit": "REDACTED" },
  "vim-abolish": { "branch": "master", "commit": "REDACTED" },
  "vim-airline": { "branch": "master", "commit": "REDACTED" },
  "vim-airline-themes": { "branch": "master", "commit": "REDACTED" },
  "vim-commentary": { "branch": "master", "commit": "REDACTED" },
  "vim-devicons": { "branch": "master", "commit": "REDACTED" },
  "vim-easymotion": { "branch": "master", "commit": "REDACTED" },
  "vim-fugitive": { "branch": "master", "commit": "REDACTED" },
  "vim-gitgutter": { "branch": "main", "commit": "REDACTED" },
  "vim-lastplace": { "branch": "master", "commit": "REDACTED" },
  "vim-polyglot": { "branch": "master", "commit": "REDACTED" },
  "vim-surround": { "branch": "master", "commit": "REDACTED" }
}